a = [
    {
        'Место': 'Maison gym',
        'Сайт': 'maisongym.ru',
        'Номер': '+7 (3462) 77‒94‒14',
        'Ссылка на 2gis': 'https://go.2gis.com/S1RYb'
    },
    {
        'Место': 'Академия ММА',
        'Сайт': 'нет',
        'Номер': '+7 (3462) 600‒086',
        'Ссылка на 2gis': 'https://go.2gis.com/e6Yzu'},
    {
        'Место': 'Apex gym', 'Сайт': 'apexgym.ru/',
        'Номер': '+7 (3462) 55‒02‒00',
        'Ссылка на 2gis': 'https://go.2gis.com/dp1Fx'
    },
    {
        'Место': 'Wrestling kids',
        'Сайт': 'нет',
        'Номер': 'нет',
        'Ссылка на 2gis': 'https://go.2gis.com/1KmCe'
    },
    {'Место': 'Чемпион86',
     'Сайт': 'champion86.ru',
     'Номер': '+7‒922‒244‒86‒86',
     'Ссылка на 2gis': 'https://go.2gis.com/T2yZy'
     },
    {
        'Место': 'Шторм', 'Сайт': 'нет', 'Номер': '+7‒932‒424‒53‒43', 'Ссылка на 2gis': 'https://go.2gis.com/fom1y'}, {'Место': 'Титан', 'Сайт': 'titanhl-surgut.ru', 'Номер': '+7 (3462) 550‒100', 'Ссылка на 2gis': 'https://go.2gis.com/sW5Ya'}, {'Место': 'World Class Сургут', 'Сайт': 'worldclass-surgut.ru', 'Номер': '+7 (3462) 94‒00‒00', 'Ссылка на 2gis': 'https://go.2gis.com/wvG3d'}, {'Место': 'АЗБУКА СПОРТА', 'Сайт': 'surgut.a-sports.ru', 'Номер': '+7 (3462) 33‒80‒77', 'Ссылка на 2gis': 'https://go.2gis.com/dhJqc'}, {'Место': 'Малибу', 'Сайт': 'malibu-surgut.ru/', 'Номер': '+7‒922‒420‒35‒88', 'Ссылка на 2gis': 'https://go.2gis.com/X1Anu'}, {'Место': 'Сила Сибири', 'Сайт': 'silasibiri86.ru', 'Номер': '+7 (3462) 99‒00‒98', 'Ссылка на 2gis': 'https://go.2gis.com/V1KyZ'}, {'Место': 'Baby_athletes', 'Сайт': 'baby-athletes.ru/?utm_source=2gis', 'Номер': '+7‒982‒220‒60‒08', 'Ссылка на 2gis': 'https://go.2gis.com/SCqvD'}, {'Место': 'Сургутский учебный центр', 'Сайт': 'dosaaf-surgut.ru', 'Номер': '+7 (3462) 22‒02‒62', 'Ссылка на 2gis': 'https://go.2gis.com/LGHz7'}, {'Место': 'Современник', 'Сайт': 'нет', 'Номер': '+7‒922‒778‒00‒08', 'Ссылка на 2gis': 'https://go.2gis.com/9UieE'}, {'Место': 'ARENA', 'Сайт': 'нет', 'Номер': '+7 (3462) 99‒04‒88', 'Ссылка на 2gis': 'https://go.2gis.com/nWlCR'}, {'Место': 'Dansway', 'Сайт': 'https://t.me/danswaycentre', 'Номер': '+7‒982‒411‒00‒20', 'Ссылка на 2gis': 'https://go.2gis.com/ouawW'}, {'Место': 'Дружба', 'Сайт': 'нет', 'Номер': 'нет', 'Ссылка на 2gis': 'https://go.2gis.com/rJDoc'}, {'Место': 'Акватория', 'Сайт': 'aquatoria86.ru', 'Номер': '+7 (3462) 56‒35‒35', 'Ссылка на 2gis': 'https://go.2gis.com/9HLbK'}, {'Место': 'Водолей', 'Сайт': 'olimp86.ru', 'Номер': '+7 (3462) 95‒75‒33', 'Ссылка на 2gis': 'https://go.2gis.com/etFjJ'}, {'Место': 'Факел', 'Сайт': 'vk.link/uss_fakel', 'Номер': '+7 (3462) 95‒54‒50', 'Ссылка на 2gis': 'https://go.2gis.com/fMHAI'}, {'Место': 'Олимп', 'Сайт': 'https://olimp86.ru/', 'Номер': '+7 (3462) 95‒75‒22', 'Ссылка на 2gis': 'https://go.2gis.com/pdbS3'}, {'Место': 'Газовик', 'Сайт': 'https://t.me/ussfakel', 'Номер': '+7 (3462) 75‒20‒47', 'Ссылка на 2gis': 'https://go.2gis.com/oQnEO'}, {'Место': 'Hope Fitness', 'Сайт': 'hopefitness.ru', 'Номер': '+7 (3462) 51‒11‒45', 'Ссылка на 2gis': 'https://go.2gis.com/62Szb'}]
